In [1]:
import pandas as pd

In [3]:
#read_table is used when we want to read the data directly from the URL
#orders is data frame object 
orders = pd.read_table('http://bit.ly/chiporders')

In [6]:
# to look at first few rows
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

# Reading the data which is not well organized

In [8]:
movie_users = pd.read_table('http://bit.ly/movieusers')

In [9]:
movie_users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

# The data is seperated using the PIPE.

In [11]:
movies_users = pd.read_table('http://bit.ly/movieusers', sep = '|')

In [12]:
movie_users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

# We can see that data is becoming the part of header. 

1. pass header=none in read_table

In [23]:
movie_users = pd.read_table('http://bit.ly/movieusers', sep = '|', header= None)

In [24]:
movie_users.head() # returns first 5 rows by default

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

# How to add the column names when header is missing 

1. create a python list of header  
2. pass the list to read_table

In [21]:
user_columns = ['user_id', 'age', 'gender', 'occupation', 'zipcode']
movie_user_cleaned = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_columns)
movie_user_cleaned.head()

   user_id  age gender  occupation zipcode
0        1   24      M  technician   85711
1        2   53      F       other   94043
2        3   23      M      writer   32067
3        4   24      M  technician   43537
4        5   33      F       other   15213

# skiprows and skipfooter: these tow can be used and very useful when we want to remove the text from the top and the bottom. Sometimes people write the text in the data file 

we can use skiprows and skipfooter to remove these text. you can pass this in the read_table.